app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.new(post_params)
        @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Philosophy"], ["room_number", 1], ["created_at", "2021-01-17 16:27:56.562741"], ["updated_at", "2021-01-17 16:27:56.562741"]]

    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class.update(post_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 2], ["updated_at", "2021-01-17 16:30:12.173805"], ["id", 1]]