app/controllers/students_controller.rb

    def create
        @student = Student.new(post_params)
        @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Madeline"], ["last_name", "Beck"], ["created_at", "2021-01-17 01:03:59.226706"], ["updated_at", "2021-01-17 01:03:59.226706"]]

    def update

        @student = Student.find(params[:id])
        @student.update(post_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Casey"], ["updated_at", "2021-01-17 16:07:23.029532"], ["id", 6]]